<!doctype html>
<html class="no-js" lang="de">
  <head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <title>Scrumbase</title>
    <link rel="stylesheet" href="css/style.css" />
    <script src="bower_components/modernizr/modernizr.js"></script>
  </head>
  <body>
    <div class="row text-center">
      <div class="large-6 columns header">
        Tagebuch
      </div>
      <div class="large-6 columns header">
        Links
      </div>      
    </div>
    <div class="paragraph">
      <div class="row">
        <div class="small-12">
          <h1>Einführung</h1>
        </div>
      </div>
      <div class="row">
        <div class="small-12 mainBox">
          <h3>
            Was ist Scrum?
          </h3>
          <div class="container">
              <p>
                Scrum ist eine agile Entwicklungsmethode f&uuml;r Softwareprojekte. Eine Entwicklungsmethode ist die Art und Weise mit der man ein Projekt plant und durchführt. Die meisten von euch werden hauptsächlich mit Wasserfall vertraut sein, und wollen wissen was der Unterschied ist.
              </p>
              <p>
                Wasserfall ist eher statisch angelegt. Es werden alle Anforderungen am Anfang definiert, und diese im Rahmen eines genauen Zeitplans jedem Teammitglied zugeteilt. Wenn sich Anforderungen ändern, ist dies schwer möglich ohne den gesamten Plan durcheinander zu bringen. Diese Methode oder eine ähnliche Methode wird von der großen Mehrheit der Firmen verwendet.
              </p>
              <p>
                Agile Methoden sind anders. Am Anfang wird nur definiert welchen Anforderungen das Endprodukt entsprechen muss. Diese Anforderungen werden dann innerhalb von mehreren Iterationen (Zeitspannen von mehreren Wochen) umgesetzt. Zwischen den Iterationen kann man Probleme im Arbeitsprozess besprechen, auf Wünsche des Auftraggebers eingehen, und andere Dinge besprechen auf die das Team während der Entwicklung kommt.
                Scrum ist eine eben solche agile Methode, und geh&ouml;rt zu den beliebtesten.
              </p>
          </div>  
        </div>  
      </div>
      <div class="row">
        <div class="small-12">
          <h1>Animation</h1>
        </div>
      </div>
      <div class="row">
        <div class="small-12 mainBox">
          <h3>
            Wie wickle ich ein Projekt mit Scrum ab?
          </h3>
          <div class="container">
            <p>Projekte mit Scrum verlaufen anders als es die meisten gewohnt sein werden, sowohl f&uuml;r die Auftragnehmer als auch f&uuml;r die Auftraggeber. Zu Beginn setzen sich Auftraggeber und jemand aus dem Team (der sogenannte Product Owner) zusammen, und besprechen was das Produkt denn alles k&ouml;nnen soll. Die Features die bei diesem Gespr&auml;ch herauskommen werden in eine Liste eingetragen, welche Product Backlog genannt wird.</p> 
            <p>Scrum ist eine agile Methode, was bedeutet, dass das Projekt schnell auf Ver&auml;nderungen der Pl&auml;ne und &auml;ußere Einfl&uuml;sse reagieren kann. Ein Nebeneffekt davon ist eine gewisse Unsicherheit betreffend der L&auml;nge des Projekts. Deshalb wird kein Endtermin festgelegt, es wird h&ouml;chstens eine Sch&auml;tzung gegeben. </p>
            <p>Normalerweise endet die Geschichte hier jetzt f&uuml;r den Auftraggeber, und er kommt erst bei der Produktabnahme wieder. Bei Scrum ist auch das anders, aber darauf kommen wir sp&auml;ter nochmal zur&uuml;ck. 
            </p>
            <p>Nun setzt sich das gesamte Team zusammen und plant den ersten Sprint. Das ist eine Zeitspanne von etwa ein bis vier Wochen, wobei zwei Wochen meist eine gute Entscheidung ist, in der an den Features des Produkts gearbeitet wird. Der Product Owner entscheidet &uuml;ber die Priorit&auml;t der Punkte aus dem Product Backlog, aber das Entwicklerteam entscheidet wie viele dieser Punkte sie in einem Sprint erledigen k&ouml;nnen. Diese werden dann im Sprint Backlog eingetragen. Im Sprint Planning Meeting wird geplant, wer wann an was arbeiten wird.</p>   
            <p>Am Beginn jeden Tages wird das Daily Scrum oder Daily Stand-Up Meeting gehalten. Jeder steht nach der Reihe auf, und berichtet kurz was er oder sie am vorhergehendem Arbeitstag gemacht haben und was er oder sie heute tun werden. Wenn irgendwo Probleme aufgetreten sind, k&ouml;nnen diese gleich nach dem Meeting besprochen werden. Damit wird sichergestellt, dass die Arbeit in die richtige Richtung verl&auml;uft.</p>   
            <p>Wenn ein Sprint zu Ende ist, wird ein Sprint Review abgehalten. Hier wird dokumentiert welche Arbeiten erledigt sind und welche noch unerledigt sind und in den n&auml;chsten Sprint eingeplant werden m&uuml;ssen. Außerdem wird der momentane Arbeitsstand (die Demo) dem Auftraggeber pr&auml;sentiert. Der Auftraggeber ist also viel mehr involviert als gew&ouml;hnlich, denn er kann den Verlauf beobachten und das Team kann so fr&uuml;her auf eventuelle &auml;nderungsw&uuml;nsche eingehen. Der Auftraggeber kann auch bei jedem dieser Meetings sagen, dass ihm das Produkt bereits gef&auml;llt und es abnehmen. Danach wird die Sprint Retrospective durchgef&uuml;hrt. In diesem Meeting wird &uuml;ber den abgeschlossenen Sprint reflektiert und m&ouml;gliche Verbesserungen des Arbeitsprozesses besprochen. 
            </p>
            <p>Der n&auml;chste Sprint beginnt. Diese Sprints werden so oft durchgef&uuml;hrt, bis das Produkt fertig, also vom Auftraggeber abgenommen ist. Dann ist das Projekt beendet und es kann eine Abschlussfeier gehalten werden. 
            </p>
          </div>  
        </div>
        <div class="row">
        <div class="small-12 mainBox">
          <h3>
            Ist Scrum f&uuml;r mein Projekt geeignet?
          </h3>
          <div class="container">
            <h4>Anfang des Projekts</h4>
            <p>Es stellt sich nat&uuml;rlich die Frage, „Ist Scrum wirklich die geeignete Methode f&uuml;r mein Projekt?“ Diese Frage kann nur jeder selber beantworten. Man sollte dabei einige Dinge bedenken. 
            </p>
            <h4>Ein paar Dinge zu bedenken</h4>
            <p>Der Auftraggeber muss nat&uuml;rlich einverstanden sein mit Scrum (und es auch verstehen), denn es verlangt mehr Involvierung im Projektalltag seiner Seite.</p>  
            <p>Eine der Grundvoraussetzung von Scrum ist es, dass das Projekt in kleinere SMARTe Ziele aufteilbar ist. Jede Aufgabe muss so definierbar sein, dass man eindeutig sagen kann ob sie bereits erf&uuml;llt ist oder nicht. Wenn das nicht m&ouml;glich ist, sollte man eine alternative Entwicklungsmethode in Erw&auml;ung ziehen. </p>
            <p>Scrum ist haupts&auml;chlich eine Methode um Software zu entwickeln. Das heißt zwar nicht, dass man Scrum gleich vergessen sollte wenn das eigene Projekt etwas anderes als Software herstellt, aber es ist m&ouml;glicherweise nicht gut adaptiert werden auf die Projektspezifikationen. 
            </p>
            <p>Scrum geht davon aus, dass alle ben&ouml;tigten Ressourcen immer verf&uuml;gbar sind, und alle Teammitglieder unabh&auml;ngig voneinander an jedem Feature arbeiten k&ouml;nnen. Ein klarer Fall wo die dies nicht zutrifft w&auml;re zum Beispiel ein Film. Hier hat man die Kamera wahrscheinlich nur f&uuml;r eine begrenzte Zeit, und muss ihre Verwendung schon fr&uuml;h effizient einplanen. Außerdem werden wahrscheinlich alle Teammitglieder beim Drehen jeder Szene gleichzeitig mitarbeiten. In den meisten F&auml;llen ist Wasserfall hier die bessere Option. Bei Softwareprojekten trifft es aber meistens zu.</p> 
            <p>Man kann mit Scrum auch mit mehreren Teams an einem Projekt zusammen arbeiten. Das ist allerdings schon eine fortgeschrittenere Technik welche wir auf dieser Seite nicht erkl&auml;ren werden. Interessierte k&ouml;nnen mehr dazu in den externen Resourcen finden. </p>
            <p>Zusammenfassend, kann (oder sollte) man Scrum verwenden, wenn folgende Punkte zutreffen: 
                <ul class="check">
                  <li>Auftraggeber ist einverstanden</li>
                  <li>Auftraggeber hat genug Zeit oder es gibt intern eine Person die ihn repr&auml;sentiert</li>
                  <li>Projektziel ist in kleine SMARTe Ziele aufteilbar</li>
                  <li>Teammitglieder sind einverstanden</li>
                  <li>Teammitglieder arbeiten am selben Standort</li>
                  <li>Teammitglieder sind mit der Methode (zumindest in Theorie) vertraut</li>
                  <li>Alle Teammitglieder k&ouml;nnen in der Regel an jeder Aufgabe arbeiten</li>
                </ul>
            </p>
          </div>  
        </div>    
      </div> 
    </div>     
    <script src="bower_components/jquery/dist/jquery.min.js"></script>
    <script src="bower_components/foundation/js/foundation.min.js"></script>
    <script src="js/script.js"></script>
  </body>
</html>
